# Ch04.4 Concatenate  and Merge

## Simple Concatenation with pd.concat

In [1]:
import pandas as pd
import numpy as np

In [2]:
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
ser1

1    A
2    B
3    C
dtype: object

In [3]:
ser2 = pd.Series(['D', 'E', 'F'], index=[4, 5, 6])
ser2

4    D
5    E
6    F
dtype: object

In [4]:
pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

By default, the concatenation takes place row-wise within the ``DataFrame`` (i.e., axis=0)

In [5]:
df1 = pd.DataFrame([['A1','B1'], ['A2','B2']],
             columns=['A', 'B'],
             index=[1,2])
df1

    A   B
1  A1  B1
2  A2  B2

In [6]:
df2 = pd.DataFrame([['A3','B3'], ['A4','B4']],
             columns=['A', 'B'],
             index=[3,4])
df2

    A   B
3  A3  B3
4  A4  B4

In [7]:
pd.concat([df1, df2])

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

pd.concat allows specification of an axis along which concatenation will take place

In [8]:
df3 = pd.DataFrame([['A0','B0'], ['A1','B1']],
             columns=['A', 'B'],
             index=[0,1])
df3

    A   B
0  A0  B0
1  A1  B1

In [9]:
df4 = pd.DataFrame([['C0','D0'], ['C1','D1']],
             columns=['C', 'D'],
             index=[0,1])
df4

    C   D
0  C0  D0
1  C1  D1

In [10]:
pd.concat([df3, df4], axis='columns')

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1

#### The append() method

In [11]:
df1.append(df2)

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

#### Duplicated indeics

In [12]:
x = pd.DataFrame([['A0','B0'], ['A1','B1']],
                 columns=['A', 'B'],index=[0,1])
x

    A   B
0  A0  B0
1  A1  B1

In [13]:
y = pd.DataFrame([['A2','B2'], ['A3','B3']],
                 columns=['A', 'B'],index=[0,1])
y

    A   B
0  A2  B2
1  A3  B3

In [14]:
pd.concat([x, y])

    A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3

In [15]:
pd.concat([x, y], verify_integrity=True)

ValueError: Indexes have overlapping values: Int64Index([0, 1], dtype='int64')

In [16]:
pd.concat([x, y], ignore_index=True)

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

## Data Merge

#### One-to-One

In [17]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [18]:
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})
df2

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [19]:
pd.merge(df1, df2)

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [20]:
# assign merged key
pd.merge(df1, df2, on='employee')

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [21]:
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})
df3

   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

In [22]:
# different merged key name
# using ‘left_on’ and ‘rigit_on’ argument
pd.merge(df1, df3, left_on="employee", 
         right_on="name")    # .drop('name', axis=1)

  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [23]:
# drop duplcated column
pd.merge(df1, df3, left_on="employee", 
         right_on="name").drop('name', axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

#### Many-to-One

In [24]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})
df4

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

In [25]:
df5 = pd.merge(df1, df2)
df5

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [26]:
pd.merge(df5, df4)

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve